//                                       Отбор элементов массива: метод FILTER
//                                           не меняет исходный массив
//  Он должен вернуть true или false в зависимости от того, хотим мы оставить текущий элемент массива или отфильтровать:
const ArrNamber = [2, 4, 5, 200, -1, 4, 320, 320, 700, 32, 4, 4, 4, 5];

const beggerNum = ArrNamber.filter((num) => {
  return num > 100;
});
console.log(beggerNum); // [200, 320, 320, 700]

const uniqueNum = ArrNamber.filter((num, index, arrey) => {
  return arrey.lastIndexOf(num) === index;
});
console.log(uniqueNum); // [2, 200, -1, 320, 700, 32, 4, 5]

//                                        Пример работы с FILTER

const movies = [
  "Титаник (1997)",
  "Чёрная Пантера (2018)",
  "Остров Собак (2018)",
  "Омерзительная Восьмерка (2015)",
];

const moviesFiltered = movies.filter(function (item) {
  return item.includes("2018");
});

console.log(moviesFiltered); // ['Чёрная Пантера (2018)', 'Остров Собак (2018)']

//

const cards = [
  "6 червей",
  "7 червей",
  "8 червей",
  "9 червей",
  "10 червей",
  "Валет червей",
  "Дама червей",
  "Король червей",
  "Туз червей",
  "6 пик",
  "7 пик",
  "8 пик",
  "9 пик",
  "10 пик",
  "Валет пик",
  "Дама пик",
  "Король пик",
  "Туз пик",
  "6 треф",
  "7 треф",
  "8 треф",
  "9 треф",
  "10 треф",
  "Валет треф",
  "Дама треф",
  "Король треф",
  "Туз треф",
  "6 бубен",
  "7 бубен",
  "8 бубен",
  "9 бубен",
  "10 бубен",
  "Валет бубен",
  "Дама бубен",
  "Король бубен",
  "Туз бубен",
];

const cardsFiltered = cards.filter(function (card) {
  return parseInt(card) && (card.includes("червей") || card.includes("бубен"));
});
console.log(cardsFiltered);



const nobel = `Рентген В.К., Германия; Зееман П., Нидерланды; Лоренц Х. А., Нидерланды; Беккерель А. А., Франция; Кюри П., Франция; Склодовская-Кюри М., Франция; Стретт [лорд Рэлей — Рейли] Дж. У., Великобритания; Ленард Ф. Э. А., Германия; Томсон Дж. Дж., Великобритания; Майкельсон А. А., США; Липман Г., Франция; Маркони Г., Италия; Браун К. Ф., Германия; Ваальс [ван-дер-Ваальс] Я. Д., Нидерланды; Вин В., Германия; Дален Н. Г., Швеция; Камерлинг-Оннес Х., Нидерланды; Лауэ М. фон, Германия; Брегг У. Л., Великобритания; Брэгг У. Г., Великобритания; Баркла Ч., Великобритания; Планк М. К., Германия; Штарк Й., Германия; Гильом [Гийом] Ш. Э., Швейцария; Эйнштейн А., Германия; БОР Н. Х. Д., Дания; Милликен Р. Э., США; Сигбан К. М., Швеция; Герц Г., Германия; Франк Дж., Германия; Перрен Ж. Б., Франция; Вильсон Ч. Т. Р., Великобритания; Комптон А. Х., США; Ричардсон О. У., Великобритания; Бройль Л. де, Франция; Раман Ч. В., Индия; Гейзенберг В. К., Германия; Дирак П. А. М., Великобритания; Шредингер Э., Австрия; Чедвик Дж., Великобритания; Андерсон К. Д., США; Гесс В. Ф., Австрия; Дэвиссон К. Дж., США; Томсон Дж. П., Великобритания; Ферми Э., Италия; Лоуренс Э. О., США; Штерн О., США; Раби И. А., США; Паули В., Швейцария; Бриджмен П. У., США; Эплтон Э. В., Великобритания; Блэкетт П. М. С., Великобритания; Юкава Х., Япония; Пауэлл С. Ф., Великобритания; Кокрофт Дж. Д., Великобритания; Уолтон Э. Т. С., Великобритания; Блох Ф., США; Перселл Э. М., США; Цернике Ф., Нидерланды; Борн М., Германия; Боте В., Германия; Куш П., США; Лэмб У. Ю., США; Бардин Дж., США; Браттейн У., США; Шокли У. Б., США; Ли Чж., США; Янг Чж., США; Тамм И. Е., СССР; Франк И. М., СССР; Черенков П. А., СССР; Сегре Э., США; Чемберлен О., США; Глазер Д.А., США; Мессбауэр Р. Л., Германия; Хофстедтер Р., США; Ландау Л. Д., СССР; Вигнер Ю. П., США; Гепперт-Майер М., США; Йенсен Й. Х. Д., Германия; Басов Н. Г., СССР; Прохоров А. М., СССР; Таунс Ч. Х., США; Томонага С., Япония; Фейнман Р. Ф., США; Швингер Дж., США; Кастлер А., Франция; Бете Х. А., США; Альварес Л. У., США; Гелл-Ман М., США; Альвен Х., Швеция; Неель Л. Э. Ф., Франция; Габор Д., Великобритания; Купер Л., США; Шриффер Дж. Р., США; Джайевер А., США; Джозефсон Б., Великобритания; Эсаки Л., США; Райл М., Великобритания; Хьюиш Э., Великобритания; Бор О., Дания; Моттельсон Б., Дания; Рейнуотер Дж., США; Рихтер Б., США; Тинг С., США; Андерсон Ф., США; Ван Флек Дж. Х., США; Мотт Н., Великобритания; Вильсон Р. В., США; Капица П. Л., СССР; Пензиас А. А., США; Вайнберг [Уэйнберг] С., США; Глэшоу Ш., США; Салам А., Пакистан; Кронин Дж. У., США; Фитч В. Л., США; Бломберген Н., США; Шавлов А. Л., США; Сигбан К. М., Швеция; Вильсон К., США; Фаулер У. А., США; Чандрасекар С., США; Мер [Ван-дер-Мер] С., Нидерланды; Руббиа К., Италия; Клитцинг К., Германия; Бинниг Г., Германия; Рорер Г., Швейцария; Руска Э., Германия; Беднорц Й. Г., Германия; Мюллер К. А., Швейцария; Ледерман Л. М., США; Стейнбергер Дж., США; Шварц М., США; Рамзей Н. Ф., США; Демелт Х. Дж., США; Пауль В., Германия; Кендалл Г., США; Тейлор Р., Канада; Фридман Дж., США; Де Жен П. Ж., Франция; Шарпак Ж., Франция; Тейлор Дж. [младший], США; Халс Р., США; Брокхауз Б., Канада; Шалл К., США; Перл М., США; Рейнес Ф., США; Ли Д., США; Ошерофф Д., США; Ричардсон Р., США; Коэн-тануджи К., Франция; Филлипс У., США; Чу С., США; Лафлин Р., США; Цуи Д., США; Штермер Х., Германия; Велтман М., Нидерланды; т Хоофт Г., Нидерланды; Алферов Ж.И., Россия; Килби Дж., США; Кремер Г., США; Вейман К., США; Кеттерле В., Германия; Корнелл Э. А., США; Джаккони Р., США; Дэвис-младший Р., США; Косиба М., Япония; Абрикосов А. А, Россия; Гинзбург В. Л., Россия; Леггет Э., США; Вилчек Ф., США; Гросс Д., США; Политцер Д., США; Глаубер Р., США; Хенш Т., Германия; Холл Дж., США; Мазер Дж., США; Смут Дж., США; Грюнберг П., Германия; Ферт А., Франция; Кобаяси М., Япония; Маскава Т., Япония; Намбу Й., Япония; Бойл У., США; Као Ч., Китай; Смит Дж., США; Гейм А.К., Россия; Новоселов К.С., Россия; Перлмуттер С., США; Рисс А., США; Шмидт Б., США; Арош С., Франция; Уайнленд Д., США; Хиггс П., Великобритания; Энглер Ф., Бельгия; Акасаки И., Япония; Амано Х., Япония; Накамура С., США; Кадзита Т., Япония; Макдональд А., Канада; Таулесс Д., Великобритания; Холдейн Д., Великобритания; Костерлиц Дж., Великобритания; Вайсс Р., США; Бэриш Б., США; Торн К., США; Эшкин А., США; Муру Ж., Франция; Стрикленд Д., Канада`;

const nobelArr = nobel.split("; ");

const rusNobel = nobelArr.filter(function (scientist) {
  return scientist.includes("Россия") || scientist.includes("СССР");
});

console.log(rusNobel);