
//                                             Преобразование массива в строку. Метод JOIN
//                                                     не меняет исходный массив


const superheroes = [
  "Зимний Солдат",
  "Шэрон Картер",
  "Хельмут Земо",
  "Черная Вдова",
  "Локи",
  "Шан-Чи и Мандарин",
  "Вечные",
  "Мисс Марвел",
  "Человек-паук",
  "Доктор Стрэндж",
  " Соколиный Глаз",
  "Барон Мордо",
  "Тор",
  "Звездный Лорд",
  "Валькирия",
  "Корг и Миек",
  "Окойе и Шури",
  "Капитан Марвел",
  "Женщина-Халк",
  "Халк",
  "Стражи Галактики",
  "Гамора",
  "Человек-муравей и Оса",
  "Железное Сердце",
  "Воитель",
  "Ник Фьюри",
  "Блэйд",
  "Фантастическая Четверка",
  "Железный человек",
  "Капитан Америка",
];

console.log(superheroes.join());

console.log(`Представляем супергероев: ${superheroes.join(", ")}`);
// при этом с исходным массивом ничего не произошло:
console.log(superheroes);

const italyCities = ["Помпеи", "Рим", "Неаполь"];

const volcanoEruption = italyCities.shift(); // метод shift() возвращает удалённый элемент
console.log(typeof volcanoEruption);
console.log(volcanoEruption.length);
console.log(italyCities);